New test added in `other_tests.go`
<details>
  <summary>Results here</summary>
=== RUN   TestRunCompleteExampleOtherVersion
=== PAUSE TestRunCompleteExampleOtherVersion
=== CONT  TestRunCompleteExampleOtherVersion
2023/11/29 09:18:29 Region eu-de VPC count: 2
2023/11/29 09:18:29 --- new best region is eu-de
2023/11/29 09:18:31 Region us-south VPC count: 14
2023/11/29 09:18:31 Best region was found!: eu-de
TestRunCompleteExampleOtherVersion 2023-11-29T09:18:31Z tests.go:234: TEMP CREATED:  /tmp/terraform-etcd-complete-poi48l618883765
TestRunCompleteExampleOtherVersion 2023-11-29T09:18:31Z tests.go:653: START: Init / Apply / Consistency Check
TestRunCompleteExampleOtherVersion 2023-11-29T09:18:31Z tests.go:719: START: Init / Apply
TestRunCompleteExampleOtherVersion 2023-11-29T09:18:31Z retry.go:91: terraform [init -upgrade=true]
TestRunCompleteExampleOtherVersion 2023-11-29T09:18:31Z logger.go:66: Running command terraform with args [init -upgrade=true]
TestRunCompleteExampleOtherVersion 2023-11-29T09:18:31Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:18:31Z logger.go:66: [0m[1mInitializing the backend...[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:18:31Z logger.go:66: [0m[1mUpgrading modules...[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:18:31Z logger.go:66: - etcd_db in ../..
TestRunCompleteExampleOtherVersion 2023-11-29T09:18:34Z logger.go:66: Downloading registry.terraform.io/terraform-ibm-modules/cbr/ibm 1.15.1 for etcd_db.cbr_rule...
TestRunCompleteExampleOtherVersion 2023-11-29T09:18:45Z logger.go:66: - etcd_db.cbr_rule in .terraform/modules/etcd_db.cbr_rule/modules/cbr-rule-module
TestRunCompleteExampleOtherVersion 2023-11-29T09:18:46Z logger.go:66: Downloading registry.terraform.io/terraform-ibm-modules/key-protect-all-inclusive/ibm 4.4.0 for key_protect_all_inclusive...
TestRunCompleteExampleOtherVersion 2023-11-29T09:18:57Z logger.go:66: - key_protect_all_inclusive in .terraform/modules/key_protect_all_inclusive
TestRunCompleteExampleOtherVersion 2023-11-29T09:18:57Z logger.go:66: Downloading git::https://github.com/terraform-ibm-modules/terraform-ibm-key-protect-key.git?ref=v1.0.3 for key_protect_all_inclusive.existing_key_ring_keys...
TestRunCompleteExampleOtherVersion 2023-11-29T09:19:08Z logger.go:66: - key_protect_all_inclusive.existing_key_ring_keys in .terraform/modules/key_protect_all_inclusive.existing_key_ring_keys
TestRunCompleteExampleOtherVersion 2023-11-29T09:19:08Z logger.go:66: Downloading git::https://github.com/terraform-ibm-modules/terraform-ibm-key-protect.git?ref=v2.2.0 for key_protect_all_inclusive.key_protect...
TestRunCompleteExampleOtherVersion 2023-11-29T09:19:20Z logger.go:66: - key_protect_all_inclusive.key_protect in .terraform/modules/key_protect_all_inclusive.key_protect
TestRunCompleteExampleOtherVersion 2023-11-29T09:19:20Z logger.go:66: Downloading git::https://github.com/terraform-ibm-modules/terraform-ibm-key-protect-key-ring.git?ref=v2.2.0 for key_protect_all_inclusive.key_protect_key_rings...
TestRunCompleteExampleOtherVersion 2023-11-29T09:19:31Z logger.go:66: - key_protect_all_inclusive.key_protect_key_rings in .terraform/modules/key_protect_all_inclusive.key_protect_key_rings
TestRunCompleteExampleOtherVersion 2023-11-29T09:19:31Z logger.go:66: Downloading git::https://github.com/terraform-ibm-modules/terraform-ibm-key-protect-key.git?ref=v1.0.3 for key_protect_all_inclusive.key_protect_keys...
TestRunCompleteExampleOtherVersion 2023-11-29T09:19:31Z logger.go:66: - key_protect_all_inclusive.key_protect_keys in .terraform/modules/key_protect_all_inclusive.key_protect_keys
TestRunCompleteExampleOtherVersion 2023-11-29T09:19:31Z logger.go:66: Downloading registry.terraform.io/terraform-ibm-modules/resource-group/ibm 1.1.0 for resource_group...
TestRunCompleteExampleOtherVersion 2023-11-29T09:19:43Z logger.go:66: - resource_group in .terraform/modules/resource_group
TestRunCompleteExampleOtherVersion 2023-11-29T09:19:43Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:19:43Z logger.go:66: [0m[1mInitializing provider plugins...[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:19:43Z logger.go:66: - Finding ibm-cloud/ibm versions matching ">= 1.49.0, >= 1.53.0, >= 1.56.1, >= 1.58.0, < 2.0.0"...
TestRunCompleteExampleOtherVersion 2023-11-29T09:19:55Z logger.go:66: - Installing ibm-cloud/ibm v1.59.1...
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:12Z logger.go:66: - Installed ibm-cloud/ibm v1.59.1 (self-signed, key ID [0m[1mAAD3B791C49CC253[0m[0m)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:12Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:12Z logger.go:66: Partner and community providers are signed by their developers.
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:12Z logger.go:66: If you'd like to know more about provider signing, you can read about it here:
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:12Z logger.go:66: https://www.terraform.io/docs/cli/plugins/signing.html
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:12Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:12Z logger.go:66: Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:12Z logger.go:66: selections it made above. Include this file in your version control repository
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:12Z logger.go:66: so that Terraform can guarantee to make the same selections by default when
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:12Z logger.go:66: you run "terraform init" in the future.[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:12Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:12Z logger.go:66: [0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:12Z logger.go:66: [0m[32m
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:12Z logger.go:66: You may now begin working with Terraform. Try running "terraform plan" to see
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:12Z logger.go:66: any changes that are required for your infrastructure. All Terraform commands
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:12Z logger.go:66: should now work.
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:12Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:12Z logger.go:66: If you ever set or change modules or backend configuration for Terraform,
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:12Z logger.go:66: rerun this command to reinitialize your working directory. If you forget, other
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:12Z logger.go:66: commands will detect it and remind you to do so if necessary.[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:12Z retry.go:91: terraform [apply -input=false -auto-approve -var admin_pass=A1s1cahlPkyWjPd -var etcd_version=3.4 -var users=[{"name" = "testuser", "password" = "A1s1cahlPkyWjPd", "type" = "database"}] -var region=eu-de -var resource_group=geretain-test-etcd -var resource_tags=[] -var prefix=etcd-complete-poi48l -lock=false]
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:12Z logger.go:66: Running command terraform with args [apply -input=false -auto-approve -var admin_pass=A1s1cahlPkyWjPd -var etcd_version=3.4 -var users=[{"name" = "testuser", "password" = "A1s1cahlPkyWjPd", "type" = "database"}] -var region=eu-de -var resource_group=geretain-test-etcd -var resource_tags=[] -var prefix=etcd-complete-poi48l -lock=false]
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:28Z logger.go:66: [0m[1mmodule.resource_group.data.ibm_resource_group.existing_resource_group[0]: Reading...[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:34Z logger.go:66: [0m[1mmodule.resource_group.data.ibm_resource_group.existing_resource_group[0]: Read complete after 7s [id=b6224eeb966842c0a89b532f44646617][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: Terraform used the selected providers to generate the following execution
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: plan. Resource actions are indicated with the following symbols:
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:   [32m+[0m create[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:  [36m<=[0m read (data resources)[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: Terraform will perform the following actions:
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: [1m  # module.etcd_db.data.ibm_database_connection.database_connection[0][0m will be read during apply
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:   # (config refers to values not yet known)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: [0m [36m<=[0m[0m data "ibm_database_connection" "database_connection" {
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m amqps         = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m analytics     = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m bi_connector  = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m cli           = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m deployment_id = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m emp           = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m endpoint_type = "private"
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m grpc          = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m https         = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m id            = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m mongodb       = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m mqtts         = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m mysql         = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m ops_manager   = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m postgres      = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m rediss        = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m secure        = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m stomp_ssl     = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m user_id       = (sensitive value)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m user_type     = (sensitive value)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:     }
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: [1m  # module.etcd_db.ibm_database.etcd_db[0m will be created
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: [0m  [32m+[0m[0m resource "ibm_database" "etcd_db" {
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m adminpassword             = (sensitive value)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m adminuser                 = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m backup_encryption_key_crn = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m configuration_schema      = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m connectionstrings         = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m groups                    = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m guid                      = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m id                        = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m key_protect_key           = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m location                  = "eu-de"
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m name                      = "etcd-complete-poi48l-etcd"
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m plan                      = "standard"
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_controller_url   = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_crn              = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_group_id         = "b6224eeb966842c0a89b532f44646617"
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_group_name       = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_name             = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_status           = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m service                   = "databases-for-etcd"
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m service_endpoints         = "private"
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m status                    = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m tags                      = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m version                   = "3.4"
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m group {
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m group_id = "member"
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m cpu {
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:               [32m+[0m[0m allocation_count = 0
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:             }
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m disk {
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:               [32m+[0m[0m allocation_mb = 20480
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:             }
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m members {
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:               [32m+[0m[0m allocation_count = 3
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:             }
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m memory {
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:               [32m+[0m[0m allocation_mb = 1024
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:             }
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:         }
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m timeouts {
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m create = "120m"
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:         }
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m users {
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           # At least one attribute in this block is (or was) sensitive,
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           # so its contents will not be displayed.
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:         }
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:     }
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: [1m  # module.etcd_db.ibm_iam_authorization_policy.policy[0][0m will be created
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: [0m  [32m+[0m[0m resource "ibm_iam_authorization_policy" "policy" {
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m id                          = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m roles                       = [
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m "Reader",
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:         ]
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m source_resource_group_id    = "b6224eeb966842c0a89b532f44646617"
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m source_resource_instance_id = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m source_resource_type        = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m source_service_account      = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m source_service_name         = "databases-for-etcd"
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m target_resource_group_id    = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m target_resource_instance_id = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m target_resource_type        = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m target_service_name         = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m transaction_id              = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m version                     = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:     }
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: [1m  # module.etcd_db.ibm_resource_key.service_credentials["etcd_admin"][0m will be created
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: [0m  [32m+[0m[0m resource "ibm_resource_key" "service_credentials" {
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m account_id            = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m created_at            = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m created_by            = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m credentials           = (sensitive value)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m credentials_json      = (sensitive value)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m crn                   = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m deleted_at            = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m deleted_by            = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m guid                  = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m iam_compatible        = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m id                    = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m name                  = "etcd_admin"
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_group_id     = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_instance_id  = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_instance_url = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m role                  = "Administrator"
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m source_crn            = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m state                 = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m status                = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m updated_at            = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m updated_by            = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m url                   = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:     }
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: [1m  # module.etcd_db.ibm_resource_key.service_credentials["etcd_operator"][0m will be created
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: [0m  [32m+[0m[0m resource "ibm_resource_key" "service_credentials" {
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m account_id            = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m created_at            = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m created_by            = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m credentials           = (sensitive value)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m credentials_json      = (sensitive value)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m crn                   = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m deleted_at            = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m deleted_by            = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m guid                  = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m iam_compatible        = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m id                    = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m name                  = "etcd_operator"
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_group_id     = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_instance_id  = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_instance_url = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m role                  = "Operator"
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m source_crn            = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m state                 = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m status                = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m updated_at            = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m updated_by            = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m url                   = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:     }
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: [1m  # module.etcd_db.ibm_resource_key.service_credentials["etcd_viewer"][0m will be created
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: [0m  [32m+[0m[0m resource "ibm_resource_key" "service_credentials" {
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m account_id            = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m created_at            = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m created_by            = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m credentials           = (sensitive value)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m credentials_json      = (sensitive value)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m crn                   = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m deleted_at            = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m deleted_by            = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m guid                  = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m iam_compatible        = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m id                    = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m name                  = "etcd_viewer"
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_group_id     = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_instance_id  = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_instance_url = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m role                  = "Editor"
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m source_crn            = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m state                 = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m status                = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m updated_at            = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m updated_by            = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m url                   = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:     }
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: [1m  # module.key_protect_all_inclusive.module.key_protect[0].ibm_kms_instance_policies.key_protect_instance_policies[0m will be created
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: [0m  [32m+[0m[0m resource "ibm_kms_instance_policies" "key_protect_instance_policies" {
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m id          = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m instance_id = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m dual_auth_delete {
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m created_by    = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m creation_date = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m enabled       = false
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m last_updated  = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m updated_by    = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:         }
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m key_create_import_access {
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m create_root_key     = true
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m create_standard_key = true
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m created_by          = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m creation_date       = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m enabled             = true
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m enforce_token       = false
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m import_root_key     = true
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m import_standard_key = true
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m last_updated        = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m updated_by          = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:         }
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m metrics {
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m created_by    = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m creation_date = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m enabled       = true
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m last_updated  = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m updated_by    = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:         }
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m rotation {
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m created_by     = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m creation_date  = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m enabled        = true
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m interval_month = 1
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m last_updated   = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m updated_by     = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:         }
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:     }
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: [1m  # module.key_protect_all_inclusive.module.key_protect[0].ibm_resource_instance.key_protect_instance[0m will be created
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: [0m  [32m+[0m[0m resource "ibm_resource_instance" "key_protect_instance" {
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m account_id              = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m allow_cleanup           = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m created_at              = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m created_by              = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m crn                     = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m dashboard_url           = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m deleted_at              = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m deleted_by              = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m extensions              = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m guid                    = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m id                      = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m last_operation          = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m location                = "eu-de"
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m locked                  = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m name                    = "etcd-complete-poi48l-kp"
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m plan                    = "tiered-pricing"
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m plan_history            = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_aliases_url    = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_bindings_url   = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_controller_url = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_crn            = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_group_crn      = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_group_id       = "b6224eeb966842c0a89b532f44646617"
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_group_name     = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_id             = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_keys_url       = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_name           = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_plan_id        = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_status         = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m restored_at             = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m restored_by             = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m scheduled_reclaim_at    = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m scheduled_reclaim_by    = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m service                 = "kms"
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m service_endpoints       = "public-and-private"
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m state                   = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m status                  = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m sub_type                = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m tags                    = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m target_crn              = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m type                    = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m update_at               = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m update_by               = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:     }
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: [1m  # module.key_protect_all_inclusive.module.key_protect_key_rings["icd-etcd"].ibm_kms_key_rings.key_ring[0m will be created
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: [0m  [32m+[0m[0m resource "ibm_kms_key_rings" "key_ring" {
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m endpoint_type = "public"
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m force_delete  = true
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m id            = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m instance_id   = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m key_ring_id   = "icd-etcd"
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:     }
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: [1m  # module.key_protect_all_inclusive.module.key_protect_keys["icd-etcd.etcd-complete-poi48l-etcd"].ibm_kms_key.key[0m will be created
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: [0m  [32m+[0m[0m resource "ibm_kms_key" "key" {
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m crn                     = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m endpoint_type           = "public"
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m force_delete            = true
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m id                      = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m instance_crn            = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m instance_id             = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m key_id                  = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m key_name                = "etcd-complete-poi48l-etcd"
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m key_ring_id             = "icd-etcd"
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m payload                 = (sensitive value)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_controller_url = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_crn            = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_group_name     = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_name           = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_status         = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m standard_key            = false
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m type                    = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:     }
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: [1m  # module.key_protect_all_inclusive.module.key_protect_keys["icd-etcd.etcd-complete-poi48l-etcd"].ibm_kms_key_policies.root_key_policy[0][0m will be created
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: [0m  [32m+[0m[0m resource "ibm_kms_key_policies" "root_key_policy" {
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m endpoint_type           = "public"
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m id                      = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m instance_id             = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m key_id                  = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_controller_url = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_crn            = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_name           = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m resource_status         = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m dual_auth_delete {
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m created_by       = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m creation_date    = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m crn              = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m enabled          = false
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m id               = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m last_update_date = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m updated_by       = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:         }
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:       [32m+[0m[0m rotation {
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m created_by       = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m creation_date    = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m crn              = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m enabled          = true
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m id               = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m interval_month   = 1
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m last_update_date = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:           [32m+[0m[0m updated_by       = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:         }
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:     }
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: [1mPlan:[0m 10 to add, 0 to change, 0 to destroy.
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: [0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66: Changes to Outputs:
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:   [32m+[0m[0m hostname = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:   [32m+[0m[0m id       = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:   [32m+[0m[0m port     = (known after apply)
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:38Z logger.go:66:   [32m+[0m[0m version  = "3.4"
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:46Z logger.go:66: [0m[1mmodule.key_protect_all_inclusive.module.key_protect[0].ibm_resource_instance.key_protect_instance: Creating...[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:20:56Z logger.go:66: [0m[1mmodule.key_protect_all_inclusive.module.key_protect[0].ibm_resource_instance.key_protect_instance: Still creating... [10s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:21:06Z logger.go:66: [0m[1mmodule.key_protect_all_inclusive.module.key_protect[0].ibm_resource_instance.key_protect_instance: Still creating... [20s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:21:16Z logger.go:66: [0m[1mmodule.key_protect_all_inclusive.module.key_protect[0].ibm_resource_instance.key_protect_instance: Still creating... [30s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:21:17Z logger.go:66: [0m[1mmodule.key_protect_all_inclusive.module.key_protect[0].ibm_resource_instance.key_protect_instance: Creation complete after 30s [id=crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8::][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:21:17Z logger.go:66: [0m[1mmodule.key_protect_all_inclusive.module.key_protect[0].ibm_kms_instance_policies.key_protect_instance_policies: Creating...[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:21:17Z logger.go:66: [0m[1mmodule.key_protect_all_inclusive.module.key_protect_key_rings["icd-etcd"].ibm_kms_key_rings.key_ring: Creating...[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:21:25Z logger.go:66: [0m[1mmodule.key_protect_all_inclusive.module.key_protect[0].ibm_kms_instance_policies.key_protect_instance_policies: Creation complete after 9s [id=crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8::][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:21:27Z logger.go:66: [0m[1mmodule.key_protect_all_inclusive.module.key_protect_key_rings["icd-etcd"].ibm_kms_key_rings.key_ring: Still creating... [10s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:21:29Z logger.go:66: [0m[1mmodule.key_protect_all_inclusive.module.key_protect_key_rings["icd-etcd"].ibm_kms_key_rings.key_ring: Creation complete after 12s [id=icd-etcd:keyRing:crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8::][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:21:29Z logger.go:66: [0m[1mmodule.key_protect_all_inclusive.module.key_protect_keys["icd-etcd.etcd-complete-poi48l-etcd"].ibm_kms_key.key: Creating...[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:21:38Z logger.go:66: [0m[1mmodule.key_protect_all_inclusive.module.key_protect_keys["icd-etcd.etcd-complete-poi48l-etcd"].ibm_kms_key.key: Creation complete after 9s [id=crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8:key:48fc2e76-8490-4d44-bd6c-317b57653e72][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:21:38Z logger.go:66: [0m[1mmodule.key_protect_all_inclusive.module.key_protect_keys["icd-etcd.etcd-complete-poi48l-etcd"].ibm_kms_key_policies.root_key_policy[0]: Creating...[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:21:48Z logger.go:66: [0m[1mmodule.key_protect_all_inclusive.module.key_protect_keys["icd-etcd.etcd-complete-poi48l-etcd"].ibm_kms_key_policies.root_key_policy[0]: Still creating... [10s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:21:52Z logger.go:66: [0m[1mmodule.key_protect_all_inclusive.module.key_protect_keys["icd-etcd.etcd-complete-poi48l-etcd"].ibm_kms_key_policies.root_key_policy[0]: Creation complete after 14s [id=crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8:key:48fc2e76-8490-4d44-bd6c-317b57653e72][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:21:52Z logger.go:66: [0m[1mmodule.etcd_db.ibm_iam_authorization_policy.policy[0]: Creating...[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:21:57Z logger.go:66: [0m[1mmodule.etcd_db.ibm_iam_authorization_policy.policy[0]: Creation complete after 6s [id=c046a955-e35b-4520-9d11-11e77700e492][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:22:01Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Creating...[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:22:11Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [10s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:22:21Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [20s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:22:31Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [30s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:22:41Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [40s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:22:51Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [50s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:23:01Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [1m0s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:23:11Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [1m10s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:23:21Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [1m20s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:23:31Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [1m30s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:23:41Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [1m40s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:23:51Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [1m50s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:24:01Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [2m0s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:24:11Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [2m10s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:24:21Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [2m20s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:24:31Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [2m30s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:24:41Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [2m40s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:24:51Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [2m50s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:25:01Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [3m0s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:25:11Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [3m10s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:25:21Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [3m20s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:25:31Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [3m30s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:25:41Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [3m40s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:25:51Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [3m50s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:26:01Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [4m0s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:26:11Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [4m10s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:26:21Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [4m20s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:26:31Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [4m30s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:26:41Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [4m40s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:26:51Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [4m50s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:27:01Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [5m0s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:27:11Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [5m10s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:27:21Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [5m20s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:27:31Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [5m30s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:27:41Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [5m40s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:27:51Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [5m50s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:28:01Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [6m0s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:28:11Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [6m10s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:28:21Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [6m20s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:28:31Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [6m30s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:28:41Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [6m40s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:28:51Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [6m50s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:29:01Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [7m0s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:29:11Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still creating... [7m10s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:29:13Z logger.go:66: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Creation complete after 7m12s [id=crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630::][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:29:13Z logger.go:66: [0m[1mmodule.etcd_db.data.ibm_database_connection.database_connection[0]: Reading...[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:29:13Z logger.go:66: [0m[1mmodule.etcd_db.ibm_resource_key.service_credentials["etcd_operator"]: Creating...[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:29:13Z logger.go:66: [0m[1mmodule.etcd_db.ibm_resource_key.service_credentials["etcd_admin"]: Creating...[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:29:13Z logger.go:66: [0m[1mmodule.etcd_db.ibm_resource_key.service_credentials["etcd_viewer"]: Creating...[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:29:14Z logger.go:66: [0m[1mmodule.etcd_db.data.ibm_database_connection.database_connection[0]: Read complete after 1s [id=2023-11-29 09:29:14.072093619 +0000 UTC][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:29:20Z logger.go:66: [0m[1mmodule.etcd_db.ibm_resource_key.service_credentials["etcd_operator"]: Creation complete after 8s [id=crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630:resource-key:32414200-5631-45e7-b0c0-e0f6ba4ee844][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:29:20Z logger.go:66: [0m[1mmodule.etcd_db.ibm_resource_key.service_credentials["etcd_admin"]: Creation complete after 8s [id=crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630:resource-key:8c483d62-8847-42ba-9a9a-89ae5d41b1f1][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:29:21Z logger.go:66: [0m[1mmodule.etcd_db.ibm_resource_key.service_credentials["etcd_viewer"]: Creation complete after 8s [id=crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630:resource-key:435f932d-0449-4e9b-a560-3a42f3332360][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:29:21Z logger.go:66: [0m[1m[32m
TestRunCompleteExampleOtherVersion 2023-11-29T09:29:21Z logger.go:66: Apply complete! Resources: 10 added, 0 changed, 0 destroyed.
TestRunCompleteExampleOtherVersion 2023-11-29T09:29:21Z logger.go:66: [0m[0m[1m[32m
TestRunCompleteExampleOtherVersion 2023-11-29T09:29:21Z logger.go:66: Outputs:
TestRunCompleteExampleOtherVersion 2023-11-29T09:29:21Z logger.go:66: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:29:21Z logger.go:66: [0mhostname = "4017c7a0-a874-4715-bb56-48b6d70e2630.c13p25pf03djhc8of4jg.private.databases.appdomain.cloud"
TestRunCompleteExampleOtherVersion 2023-11-29T09:29:21Z logger.go:66: id = "crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630::"
TestRunCompleteExampleOtherVersion 2023-11-29T09:29:21Z logger.go:66: port = "30754"
TestRunCompleteExampleOtherVersion 2023-11-29T09:29:21Z logger.go:66: version = "3.4"
TestRunCompleteExampleOtherVersion 2023-11-29T09:29:21Z tests.go:722: FINISHED: Init / Apply
TestRunCompleteExampleOtherVersion 2023-11-29T09:29:21Z tests.go:684: START: Init / Plan / Show w/Struct
TestRunCompleteExampleOtherVersion 2023-11-29T09:29:21Z retry.go:91: terraform [init -upgrade=true]
TestRunCompleteExampleOtherVersion 2023-11-29T09:30:45Z retry.go:91: terraform [plan -input=false -lock=false -var resource_group=geretain-test-etcd -var resource_tags=[] -var prefix=etcd-complete-poi48l -var admin_pass=A1s1cahlPkyWjPd -var etcd_version=3.4 -var users=[{"password" = "A1s1cahlPkyWjPd", "type" = "database", "name" = "testuser"}] -var region=eu-de -lock=false -out=/tmp/terraform-etcd-complete-poi48l618883765/examples/complete/terratest-plan-file-3645868980]
TestRunCompleteExampleOtherVersion 2023-11-29T09:31:59Z retry.go:91: terraform [show -no-color -json /tmp/terraform-etcd-complete-poi48l618883765/examples/complete/terratest-plan-file-3645868980]
TestRunCompleteExampleOtherVersion 2023-11-29T09:32:04Z tests.go:702: FINISHED: Init / Plan / Show w/Struct
TestRunCompleteExampleOtherVersion 2023-11-29T09:32:05Z retry.go:91: terraform [plan -input=false -lock=false -var prefix=etcd-complete-poi48l -var admin_pass=A1s1cahlPkyWjPd -var etcd_version=3.4 -var users=[{"password" = "A1s1cahlPkyWjPd", "type" = "database", "name" = "testuser"}] -var region=eu-de -var resource_group=geretain-test-etcd -var resource_tags=[] -lock=false -out=/tmp/terraform-etcd-complete-poi48l618883765/examples/complete/terratest-plan-file-3645868980]
TestRunCompleteExampleOtherVersion 2023-11-29T09:32:05Z command.go:100: Running command terraform with args [plan -input=false -lock=false -var prefix=etcd-complete-poi48l -var admin_pass=A1s1cahlPkyWjPd -var etcd_version=3.4 -var users=[{"password" = "A1s1cahlPkyWjPd", "type" = "database", "name" = "testuser"}] -var region=eu-de -var resource_group=geretain-test-etcd -var resource_tags=[] -lock=false -out=/tmp/terraform-etcd-complete-poi48l618883765/examples/complete/terratest-plan-file-3645868980]
TestRunCompleteExampleOtherVersion 2023-11-29T09:32:20Z command.go:185: [0m[1mmodule.resource_group.data.ibm_resource_group.existing_resource_group[0]: Reading...[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:32:26Z command.go:185: [0m[1mmodule.resource_group.data.ibm_resource_group.existing_resource_group[0]: Read complete after 5s [id=b6224eeb966842c0a89b532f44646617][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:32:26Z command.go:185: [0m[1mmodule.key_protect_all_inclusive.module.key_protect[0].ibm_resource_instance.key_protect_instance: Refreshing state... [id=crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8::][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:32:35Z command.go:185: [0m[1mmodule.key_protect_all_inclusive.module.key_protect_key_rings["icd-etcd"].ibm_kms_key_rings.key_ring: Refreshing state... [id=icd-etcd:keyRing:crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8::][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:32:35Z command.go:185: [0m[1mmodule.key_protect_all_inclusive.module.key_protect[0].ibm_kms_instance_policies.key_protect_instance_policies: Refreshing state... [id=crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8::][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:32:39Z command.go:185: [0m[1mmodule.key_protect_all_inclusive.module.key_protect_keys["icd-etcd.etcd-complete-poi48l-etcd"].ibm_kms_key.key: Refreshing state... [id=crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8:key:48fc2e76-8490-4d44-bd6c-317b57653e72][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:32:47Z command.go:185: [0m[1mmodule.key_protect_all_inclusive.module.key_protect_keys["icd-etcd.etcd-complete-poi48l-etcd"].ibm_kms_key_policies.root_key_policy[0]: Refreshing state... [id=crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8:key:48fc2e76-8490-4d44-bd6c-317b57653e72][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:32:54Z command.go:185: [0m[1mmodule.etcd_db.ibm_iam_authorization_policy.policy[0]: Refreshing state... [id=c046a955-e35b-4520-9d11-11e77700e492][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:32:58Z command.go:185: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Refreshing state... [id=crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630::][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:33:11Z command.go:185: [0m[1mmodule.etcd_db.ibm_resource_key.service_credentials["etcd_viewer"]: Refreshing state... [id=crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630:resource-key:435f932d-0449-4e9b-a560-3a42f3332360][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:33:11Z command.go:185: [0m[1mmodule.etcd_db.ibm_resource_key.service_credentials["etcd_admin"]: Refreshing state... [id=crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630:resource-key:8c483d62-8847-42ba-9a9a-89ae5d41b1f1][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:33:11Z command.go:185: [0m[1mmodule.etcd_db.ibm_resource_key.service_credentials["etcd_operator"]: Refreshing state... [id=crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630:resource-key:32414200-5631-45e7-b0c0-e0f6ba4ee844][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:33:11Z command.go:185: [0m[1mmodule.etcd_db.data.ibm_database_connection.database_connection[0]: Reading...[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:33:12Z command.go:185: [0m[1mmodule.etcd_db.data.ibm_database_connection.database_connection[0]: Read complete after 1s [id=2023-11-29 09:33:12.679169274 +0000 UTC][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:33:13Z command.go:185: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:33:13Z command.go:185: [0m[1m[32mNo changes.[0m[1m Your infrastructure matches the configuration.[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:33:13Z command.go:185: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:33:13Z command.go:185: [0mTerraform has compared your real infrastructure against your configuration
TestRunCompleteExampleOtherVersion 2023-11-29T09:33:13Z command.go:185: and found no differences, so no changes are needed.
TestRunCompleteExampleOtherVersion 2023-11-29T09:33:13Z tests.go:665: FINISHED: Init / Apply / Consistency Check
TestRunCompleteExampleOtherVersion 2023-11-29T09:33:13Z retry.go:91: terraform [output -no-color -json]
TestRunCompleteExampleOtherVersion 2023-11-29T09:33:15Z tests.go:344: START: Destroy
TestRunCompleteExampleOtherVersion 2023-11-29T09:33:15Z retry.go:91: terraform [destroy -auto-approve -input=false -var users=[{"password" = "A1s1cahlPkyWjPd", "type" = "database", "name" = "testuser"}] -var region=eu-de -var resource_group=geretain-test-etcd -var resource_tags=[] -var prefix=etcd-complete-poi48l -var admin_pass=A1s1cahlPkyWjPd -var etcd_version=3.4 -lock=false]
TestRunCompleteExampleOtherVersion 2023-11-29T09:33:15Z command.go:100: Running command terraform with args [destroy -auto-approve -input=false -var users=[{"password" = "A1s1cahlPkyWjPd", "type" = "database", "name" = "testuser"}] -var region=eu-de -var resource_group=geretain-test-etcd -var resource_tags=[] -var prefix=etcd-complete-poi48l -var admin_pass=A1s1cahlPkyWjPd -var etcd_version=3.4 -lock=false]
TestRunCompleteExampleOtherVersion 2023-11-29T09:33:29Z command.go:185: [0m[1mmodule.resource_group.data.ibm_resource_group.existing_resource_group[0]: Reading...[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:33:35Z command.go:185: [0m[1mmodule.resource_group.data.ibm_resource_group.existing_resource_group[0]: Read complete after 6s [id=b6224eeb966842c0a89b532f44646617][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:33:35Z command.go:185: [0m[1mmodule.key_protect_all_inclusive.module.key_protect[0].ibm_resource_instance.key_protect_instance: Refreshing state... [id=crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8::][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:33:44Z command.go:185: [0m[1mmodule.key_protect_all_inclusive.module.key_protect[0].ibm_kms_instance_policies.key_protect_instance_policies: Refreshing state... [id=crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8::][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:33:44Z command.go:185: [0m[1mmodule.key_protect_all_inclusive.module.key_protect_key_rings["icd-etcd"].ibm_kms_key_rings.key_ring: Refreshing state... [id=icd-etcd:keyRing:crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8::][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:33:48Z command.go:185: [0m[1mmodule.key_protect_all_inclusive.module.key_protect_keys["icd-etcd.etcd-complete-poi48l-etcd"].ibm_kms_key.key: Refreshing state... [id=crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8:key:48fc2e76-8490-4d44-bd6c-317b57653e72][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:33:55Z command.go:185: [0m[1mmodule.key_protect_all_inclusive.module.key_protect_keys["icd-etcd.etcd-complete-poi48l-etcd"].ibm_kms_key_policies.root_key_policy[0]: Refreshing state... [id=crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8:key:48fc2e76-8490-4d44-bd6c-317b57653e72][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:03Z command.go:185: [0m[1mmodule.etcd_db.ibm_iam_authorization_policy.policy[0]: Refreshing state... [id=c046a955-e35b-4520-9d11-11e77700e492][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:07Z command.go:185: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Refreshing state... [id=crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630::][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:19Z command.go:185: [0m[1mmodule.etcd_db.ibm_resource_key.service_credentials["etcd_viewer"]: Refreshing state... [id=crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630:resource-key:435f932d-0449-4e9b-a560-3a42f3332360][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:19Z command.go:185: [0m[1mmodule.etcd_db.ibm_resource_key.service_credentials["etcd_operator"]: Refreshing state... [id=crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630:resource-key:32414200-5631-45e7-b0c0-e0f6ba4ee844][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:19Z command.go:185: [0m[1mmodule.etcd_db.data.ibm_database_connection.database_connection[0]: Reading...[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:19Z command.go:185: [0m[1mmodule.etcd_db.ibm_resource_key.service_credentials["etcd_admin"]: Refreshing state... [id=crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630:resource-key:8c483d62-8847-42ba-9a9a-89ae5d41b1f1][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:20Z command.go:185: [0m[1mmodule.etcd_db.data.ibm_database_connection.database_connection[0]: Read complete after 1s [id=2023-11-29 09:34:20.546113182 +0000 UTC][0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: Terraform used the selected providers to generate the following execution
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: plan. Resource actions are indicated with the following symbols:
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:   [31m-[0m destroy[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: Terraform will perform the following actions:
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: [1m  # module.etcd_db.ibm_database.etcd_db[0m will be [1m[31mdestroyed[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: [0m  [31m-[0m[0m resource "ibm_database" "etcd_db" {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m adminpassword             = (sensitive value) [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m adminuser                 = "root" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m backup_encryption_key_crn = "crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8:key:48fc2e76-8490-4d44-bd6c-317b57653e72" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m connectionstrings         = [
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m bundlebase64 = ""
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m bundlename   = ""
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m certbase64   = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURIVENDQWdXZ0F3SUJBZ0lVVmlhMWZrWElsTXhGY2lob3lncWg2Yit6N0pNd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0hqRWNNQm9HQTFVRUF3d1RTVUpOSUVOc2IzVmtJRVJoZEdGaVlYTmxjekFlRncweE9ERXdNVEV4TkRRNApOVEZhRncweU9ERXdNRGd4TkRRNE5URmFNQjR4SERBYUJnTlZCQU1NRTBsQ1RTQkRiRzkxWkNCRVlYUmhZbUZ6ClpYTXdnZ0VpTUEwR0NTcUdTSWIzRFFFQkFRVUFBNElCRHdBd2dnRUtBb0lCQVFESkYxMlNjbTJGUmpQb2N1bmYKbmNkUkFMZDhJRlpiWDhpbDM3MDZ4UEV2b3ZpMTRHNGVIRWZuT1JRY2g3VElPR212RWxITVllbUtFT3Z3K0VZUApmOXpqU1IxNFVBOXJYeHVaQmgvZDlRa2pjTkw2YmMvbUNUOXpYbmpzdC9qRzJSbHdmRU1lZnVIQWp1T3c4bkJuCllQeFpiNm1ycVN6T2FtSmpnVVp6c1RMeHRId21yWkxuOGhlZnhITlBrdGFVMUtFZzNQRkJxaWpDMG9uWFpnOGMKanpZVVVXNkpBOWZZcWJBL1YxMkFsT3AvUXhKUVVoZlB5YXozN0FEdGpJRkYybkxVMjBicWdyNWhqTjA4SjZQUwpnUk5hNXc2T1N1RGZiZ2M4V3Z3THZzbDQvM281akFVSHp2OHJMaWF6d2VPYzlTcDBKd3JHdUJuYTFPYm9mbHU5ClM5SS9BZ01CQUFHalV6QlJNQjBHQTFVZERnUVdCQlJGejFFckZFSU1CcmFDNndiQjNNMHpuYm1IMmpBZkJnTlYKSFNNRUdEQVdnQlJGejFFckZFSU1CcmFDNndiQjNNMHpuYm1IMmpBUEJnTlZIUk1CQWY4RUJUQURBUUgvTUEwRwpDU3FHU0liM0RRRUJDd1VBQTRJQkFRQ2t4NVJzbk9PMWg0dFJxRzh3R21ub1EwOHNValpsRXQvc2tmR0pBL2RhClUveEZMMndhNjljTTdNR1VMRitoeXZYSEJScnVOTCtJM1ROSmtVUEFxMnNhakZqWEtCeVdrb0JYYnRyc2ZKckkKQWhjZnlzN29tdjJmb0pHVGxJY0FybnBCL0p1bEZITmM1YXQzVk1rSTlidEh3ZUlYNFE1QmdlVlU5cjdDdlArSgpWRjF0YWxSUVpKandyeVhsWGJvQ0c0MTU2TUtwTDIwMUwyV1dqazBydlBVWnRKcjhmTmd6M24wb0x5MFZ0Zm93Ck1yUFh4THk5TlBqOGlzT3V0ckxEMjlJWTJBMFY0UmxjSXhTMEw3c1ZPeTB6RDZwbXpNTVFNRC81aWZ1SVg2YnEKbEplZzV4akt2TytwbElLTWhPU1F5dTRUME1NeTZmY2t3TVpPK0liR3JDZHIKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m certname     = "1fa4c2a5-03a2-4559-abec-9c6ef81bd506"
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m composed     = "https://testuser:$PASSWORD@4017c7a0-a874-4715-bb56-48b6d70e2630.c13p25pf03djhc8of4jg.private.databases.appdomain.cloud:30754"
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m database     = ""
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m hosts        = [
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                   [31m-[0m[0m {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                       [31m-[0m[0m hostname = "4017c7a0-a874-4715-bb56-48b6d70e2630.c13p25pf03djhc8of4jg.private.databases.appdomain.cloud"
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                       [31m-[0m[0m port     = "30754"
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                     },
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                 ]
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m name         = "testuser"
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m password     = ""
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m path         = ""
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m queryoptions = ""
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m scheme       = "https"
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:             },
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m bundlebase64 = ""
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m bundlename   = ""
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m certbase64   = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURIVENDQWdXZ0F3SUJBZ0lVVmlhMWZrWElsTXhGY2lob3lncWg2Yit6N0pNd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0hqRWNNQm9HQTFVRUF3d1RTVUpOSUVOc2IzVmtJRVJoZEdGaVlYTmxjekFlRncweE9ERXdNVEV4TkRRNApOVEZhRncweU9ERXdNRGd4TkRRNE5URmFNQjR4SERBYUJnTlZCQU1NRTBsQ1RTQkRiRzkxWkNCRVlYUmhZbUZ6ClpYTXdnZ0VpTUEwR0NTcUdTSWIzRFFFQkFRVUFBNElCRHdBd2dnRUtBb0lCQVFESkYxMlNjbTJGUmpQb2N1bmYKbmNkUkFMZDhJRlpiWDhpbDM3MDZ4UEV2b3ZpMTRHNGVIRWZuT1JRY2g3VElPR212RWxITVllbUtFT3Z3K0VZUApmOXpqU1IxNFVBOXJYeHVaQmgvZDlRa2pjTkw2YmMvbUNUOXpYbmpzdC9qRzJSbHdmRU1lZnVIQWp1T3c4bkJuCllQeFpiNm1ycVN6T2FtSmpnVVp6c1RMeHRId21yWkxuOGhlZnhITlBrdGFVMUtFZzNQRkJxaWpDMG9uWFpnOGMKanpZVVVXNkpBOWZZcWJBL1YxMkFsT3AvUXhKUVVoZlB5YXozN0FEdGpJRkYybkxVMjBicWdyNWhqTjA4SjZQUwpnUk5hNXc2T1N1RGZiZ2M4V3Z3THZzbDQvM281akFVSHp2OHJMaWF6d2VPYzlTcDBKd3JHdUJuYTFPYm9mbHU5ClM5SS9BZ01CQUFHalV6QlJNQjBHQTFVZERnUVdCQlJGejFFckZFSU1CcmFDNndiQjNNMHpuYm1IMmpBZkJnTlYKSFNNRUdEQVdnQlJGejFFckZFSU1CcmFDNndiQjNNMHpuYm1IMmpBUEJnTlZIUk1CQWY4RUJUQURBUUgvTUEwRwpDU3FHU0liM0RRRUJDd1VBQTRJQkFRQ2t4NVJzbk9PMWg0dFJxRzh3R21ub1EwOHNValpsRXQvc2tmR0pBL2RhClUveEZMMndhNjljTTdNR1VMRitoeXZYSEJScnVOTCtJM1ROSmtVUEFxMnNhakZqWEtCeVdrb0JYYnRyc2ZKckkKQWhjZnlzN29tdjJmb0pHVGxJY0FybnBCL0p1bEZITmM1YXQzVk1rSTlidEh3ZUlYNFE1QmdlVlU5cjdDdlArSgpWRjF0YWxSUVpKandyeVhsWGJvQ0c0MTU2TUtwTDIwMUwyV1dqazBydlBVWnRKcjhmTmd6M24wb0x5MFZ0Zm93Ck1yUFh4THk5TlBqOGlzT3V0ckxEMjlJWTJBMFY0UmxjSXhTMEw3c1ZPeTB6RDZwbXpNTVFNRC81aWZ1SVg2YnEKbEplZzV4akt2TytwbElLTWhPU1F5dTRUME1NeTZmY2t3TVpPK0liR3JDZHIKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m certname     = "1fa4c2a5-03a2-4559-abec-9c6ef81bd506"
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m composed     = "https://root:$PASSWORD@4017c7a0-a874-4715-bb56-48b6d70e2630.c13p25pf03djhc8of4jg.private.databases.appdomain.cloud:30754"
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m database     = ""
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m hosts        = [
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                   [31m-[0m[0m {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                       [31m-[0m[0m hostname = "4017c7a0-a874-4715-bb56-48b6d70e2630.c13p25pf03djhc8of4jg.private.databases.appdomain.cloud"
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                       [31m-[0m[0m port     = "30754"
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                     },
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                 ]
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m name         = "root"
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m password     = ""
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m path         = ""
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m queryoptions = ""
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m scheme       = "https"
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:             },
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:         ] [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m groups                    = [
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m count    = 3
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m cpu      = [
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                   [31m-[0m[0m {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                       [31m-[0m[0m allocation_count = 0
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                       [31m-[0m[0m can_scale_down   = true
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                       [31m-[0m[0m is_adjustable    = true
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                       [31m-[0m[0m minimum_count    = 9
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                       [31m-[0m[0m step_size_count  = 3
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                       [31m-[0m[0m units            = "count"
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                     },
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                 ]
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m disk     = [
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                   [31m-[0m[0m {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                       [31m-[0m[0m allocation_mb  = 61440
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                       [31m-[0m[0m can_scale_down = false
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                       [31m-[0m[0m is_adjustable  = true
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                       [31m-[0m[0m minimum_mb     = 61440
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                       [31m-[0m[0m step_size_mb   = 3072
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                       [31m-[0m[0m units          = "mb"
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                     },
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                 ]
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m group_id = "member"
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m memory   = [
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                   [31m-[0m[0m {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                       [31m-[0m[0m allocation_mb  = 3072
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                       [31m-[0m[0m can_scale_down = true
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                       [31m-[0m[0m is_adjustable  = true
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                       [31m-[0m[0m minimum_mb     = 3072
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                       [31m-[0m[0m step_size_mb   = 384
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                       [31m-[0m[0m units          = "mb"
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                     },
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:                 ]
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:             },
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:         ] [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m guid                      = "4017c7a0-a874-4715-bb56-48b6d70e2630" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m id                        = "crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630::" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m key_protect_key           = "crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8:key:48fc2e76-8490-4d44-bd6c-317b57653e72" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m location                  = "eu-de" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m name                      = "etcd-complete-poi48l-etcd" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m plan                      = "standard" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_controller_url   = "https://cloud.ibm.com/services/crn%3Av1%3Abluemix%3Apublic%3Adatabases-for-etcd%3Aeu-de%3Aa%2Fabac0df06b644a9cabc6e44f55b3880e%3A4017c7a0-a874-4715-bb56-48b6d70e2630%3A%3A" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_crn              = "crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630::" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_group_id         = "b6224eeb966842c0a89b532f44646617" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_group_name       = "crn:v1:bluemix:public:resource-controller::a/abac0df06b644a9cabc6e44f55b3880e::resource-group:b6224eeb966842c0a89b532f44646617" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_name             = "etcd-complete-poi48l-etcd" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_status           = "active" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m service                   = "databases-for-etcd" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m service_endpoints         = "private" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m status                    = "active" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m tags                      = [] [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m version                   = "3.4" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m auto_scaling {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m cpu {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m rate_increase_percent       = 10 [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m rate_limit_count_per_member = 30 [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m rate_period_seconds         = 900 [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m rate_units                  = "count" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:             }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m disk {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m capacity_enabled             = false [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m free_space_less_than_percent = 10 [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m io_above_percent             = 90 [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m io_enabled                   = false [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m io_over_period               = "15m" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m rate_increase_percent        = 10 [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m rate_limit_mb_per_member     = 3670016 [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m rate_period_seconds          = 900 [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m rate_units                   = "mb" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:             }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m memory {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m io_above_percent         = 90 [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m io_enabled               = false [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m io_over_period           = "15m" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m rate_increase_percent    = 10 [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m rate_limit_mb_per_member = 114688 [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m rate_period_seconds      = 900 [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m rate_units               = "mb" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:             }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:         }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m group {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m group_id = "member" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m cpu {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m allocation_count = 0 [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:             }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m disk {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m allocation_mb = 20480 [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:             }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m members {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m allocation_count = 3 [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:             }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m memory {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m allocation_mb = 1024 [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:             }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:         }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m timeouts {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m create = "120m" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:         }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m users {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           # At least one attribute in this block is (or was) sensitive,
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           # so its contents will not be displayed.
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:         }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:     }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: [1m  # module.etcd_db.ibm_iam_authorization_policy.policy[0][0m will be [1m[31mdestroyed[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: [0m  [31m-[0m[0m resource "ibm_iam_authorization_policy" "policy" {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m id                          = "c046a955-e35b-4520-9d11-11e77700e492" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m roles                       = [
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m "Reader",
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:         ] [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m source_resource_group_id    = "b6224eeb966842c0a89b532f44646617" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m source_service_account      = "abac0df06b644a9cabc6e44f55b3880e" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m source_service_name         = "databases-for-etcd" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m target_resource_instance_id = "bed19d91-dd72-4ee4-925b-148fb5c3e0d8" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m target_service_name         = "kms" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m transaction_id              = "ec5db8ce3a83411cbe2f0bb887d3012e" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_attributes {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m name     = "accountId" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m operator = "stringEquals" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m value    = "abac0df06b644a9cabc6e44f55b3880e" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:         }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_attributes {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m name     = "serviceInstance" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m operator = "stringEquals" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m value    = "bed19d91-dd72-4ee4-925b-148fb5c3e0d8" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:         }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_attributes {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m name     = "serviceName" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m operator = "stringEquals" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m value    = "kms" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:         }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m subject_attributes {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m name  = "accountId" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m value = "abac0df06b644a9cabc6e44f55b3880e" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:         }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m subject_attributes {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m name  = "resourceGroupId" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m value = "b6224eeb966842c0a89b532f44646617" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:         }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m subject_attributes {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m name  = "serviceName" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m value = "databases-for-etcd" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:         }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:     }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: [1m  # module.etcd_db.ibm_resource_key.service_credentials["etcd_admin"][0m will be [1m[31mdestroyed[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: [0m  [31m-[0m[0m resource "ibm_resource_key" "service_credentials" {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m account_id            = "abac0df06b644a9cabc6e44f55b3880e" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m created_at            = "2023-11-29T09:29:21.018Z" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m created_by            = "IBMid-664003Y3Z3" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m credentials           = (sensitive value) [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m credentials_json      = (sensitive value) [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m crn                   = "crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630:resource-key:8c483d62-8847-42ba-9a9a-89ae5d41b1f1" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m guid                  = "8c483d62-8847-42ba-9a9a-89ae5d41b1f1" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m iam_compatible        = false [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m id                    = "crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630:resource-key:8c483d62-8847-42ba-9a9a-89ae5d41b1f1" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m name                  = "etcd_admin" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_group_id     = "b6224eeb966842c0a89b532f44646617" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_instance_id  = "crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630::" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_instance_url = "/v2/resource_instances/4017c7a0-a874-4715-bb56-48b6d70e2630" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m role                  = "Administrator" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m source_crn            = "crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630::" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m state                 = "active" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m status                = "active" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m updated_at            = "2023-11-29T09:29:21.018Z" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m url                   = "/v2/resource_keys/8c483d62-8847-42ba-9a9a-89ae5d41b1f1" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:     }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: [1m  # module.etcd_db.ibm_resource_key.service_credentials["etcd_operator"][0m will be [1m[31mdestroyed[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: [0m  [31m-[0m[0m resource "ibm_resource_key" "service_credentials" {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m account_id            = "abac0df06b644a9cabc6e44f55b3880e" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m created_at            = "2023-11-29T09:29:21.087Z" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m created_by            = "IBMid-664003Y3Z3" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m credentials           = (sensitive value) [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m credentials_json      = (sensitive value) [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m crn                   = "crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630:resource-key:32414200-5631-45e7-b0c0-e0f6ba4ee844" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m guid                  = "32414200-5631-45e7-b0c0-e0f6ba4ee844" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m iam_compatible        = false [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m id                    = "crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630:resource-key:32414200-5631-45e7-b0c0-e0f6ba4ee844" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m name                  = "etcd_operator" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_group_id     = "b6224eeb966842c0a89b532f44646617" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_instance_id  = "crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630::" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_instance_url = "/v2/resource_instances/4017c7a0-a874-4715-bb56-48b6d70e2630" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m role                  = "Operator" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m source_crn            = "crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630::" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m state                 = "active" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m status                = "active" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m updated_at            = "2023-11-29T09:29:21.087Z" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m url                   = "/v2/resource_keys/32414200-5631-45e7-b0c0-e0f6ba4ee844" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:     }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: [1m  # module.etcd_db.ibm_resource_key.service_credentials["etcd_viewer"][0m will be [1m[31mdestroyed[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: [0m  [31m-[0m[0m resource "ibm_resource_key" "service_credentials" {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m account_id            = "abac0df06b644a9cabc6e44f55b3880e" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m created_at            = "2023-11-29T09:29:21.111Z" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m created_by            = "IBMid-664003Y3Z3" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m credentials           = (sensitive value) [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m credentials_json      = (sensitive value) [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m crn                   = "crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630:resource-key:435f932d-0449-4e9b-a560-3a42f3332360" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m guid                  = "435f932d-0449-4e9b-a560-3a42f3332360" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m iam_compatible        = false [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m id                    = "crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630:resource-key:435f932d-0449-4e9b-a560-3a42f3332360" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m name                  = "etcd_viewer" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_group_id     = "b6224eeb966842c0a89b532f44646617" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_instance_id  = "crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630::" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_instance_url = "/v2/resource_instances/4017c7a0-a874-4715-bb56-48b6d70e2630" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m role                  = "Editor" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m source_crn            = "crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630::" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m state                 = "active" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m status                = "active" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m updated_at            = "2023-11-29T09:29:21.111Z" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m url                   = "/v2/resource_keys/435f932d-0449-4e9b-a560-3a42f3332360" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:     }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: [1m  # module.key_protect_all_inclusive.module.key_protect[0].ibm_kms_instance_policies.key_protect_instance_policies[0m will be [1m[31mdestroyed[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: [0m  [31m-[0m[0m resource "ibm_kms_instance_policies" "key_protect_instance_policies" {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m id          = "crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8::" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m instance_id = "bed19d91-dd72-4ee4-925b-148fb5c3e0d8" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m dual_auth_delete {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m created_by    = "IBMid-664003Y3Z3" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m creation_date = "2023-11-29 09:21:23 +0000 UTC" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m enabled       = false [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m last_updated  = "2023-11-29 09:21:23 +0000 UTC" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m updated_by    = "IBMid-664003Y3Z3" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:         }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m key_create_import_access {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m create_root_key     = true [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m create_standard_key = true [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m created_by          = "IBMid-664003Y3Z3" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m creation_date       = "2023-11-29 09:21:23 +0000 UTC" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m enabled             = true [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m enforce_token       = false [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m import_root_key     = true [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m import_standard_key = true [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m last_updated        = "2023-11-29 09:21:23 +0000 UTC" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m updated_by          = "IBMid-664003Y3Z3" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:         }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m metrics {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m created_by    = "IBMid-664003Y3Z3" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m creation_date = "2023-11-29 09:21:23 +0000 UTC" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m enabled       = true [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m last_updated  = "2023-11-29 09:21:23 +0000 UTC" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m updated_by    = "IBMid-664003Y3Z3" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:         }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m rotation {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m created_by     = "IBMid-664003Y3Z3" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m creation_date  = "2023-11-29 09:21:23 +0000 UTC" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m enabled        = true [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m interval_month = 1 [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m last_updated   = "2023-11-29 09:21:23 +0000 UTC" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m updated_by     = "IBMid-664003Y3Z3" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:         }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:     }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: [1m  # module.key_protect_all_inclusive.module.key_protect[0].ibm_resource_instance.key_protect_instance[0m will be [1m[31mdestroyed[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: [0m  [31m-[0m[0m resource "ibm_resource_instance" "key_protect_instance" {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m account_id              = "abac0df06b644a9cabc6e44f55b3880e" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m allow_cleanup           = false [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m created_at              = "2023-11-29T09:20:59.499Z" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m created_by              = "IBMid-664003Y3Z3" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m crn                     = "crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8::" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m dashboard_url           = "/keyprotect/crn%3Av1%3Abluemix%3Apublic%3Akms%3Aeu-de%3Aa%2Fabac0df06b644a9cabc6e44f55b3880e%3Abed19d91-dd72-4ee4-925b-148fb5c3e0d8%3A%3A" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m extensions              = {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m "endpoints.private" = "https://private.eu-de.kms.cloud.ibm.com"
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m "endpoints.public"  = "https://eu-de.kms.cloud.ibm.com"
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:         } [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m guid                    = "bed19d91-dd72-4ee4-925b-148fb5c3e0d8" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m id                      = "crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8::" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m last_operation          = {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m "async"       = "false"
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m "cancelable"  = "false"
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m "description" = "Completed create instance operation"
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m "poll"        = "false"
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m "state"       = "succeeded"
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m "type"        = "create"
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:         } [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m location                = "eu-de" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m locked                  = false [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m name                    = "etcd-complete-poi48l-kp" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m plan                    = "tiered-pricing" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m plan_history            = [
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m resource_plan_id = "eedd3585-90c6-4c8f-be3d-062069e99fc3"
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:               [31m-[0m[0m start_date       = "2023-11-29T09:20:59.499Z"
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:             },
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:         ] [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_aliases_url    = "/v2/resource_instances/bed19d91-dd72-4ee4-925b-148fb5c3e0d8/resource_aliases" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_bindings_url   = "/v2/resource_instances/bed19d91-dd72-4ee4-925b-148fb5c3e0d8/resource_bindings" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_controller_url = "https://cloud.ibm.com/services/" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_crn            = "crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8::" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_group_crn      = "crn:v1:bluemix:public:resource-controller::a/abac0df06b644a9cabc6e44f55b3880e::resource-group:b6224eeb966842c0a89b532f44646617" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_group_id       = "b6224eeb966842c0a89b532f44646617" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_group_name     = "crn:v1:bluemix:public:resource-controller::a/abac0df06b644a9cabc6e44f55b3880e::resource-group:b6224eeb966842c0a89b532f44646617" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_id             = "ee41347f-b18e-4ca6-bf80-b5467c63f9a6" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_keys_url       = "/v2/resource_instances/bed19d91-dd72-4ee4-925b-148fb5c3e0d8/resource_keys" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_name           = "etcd-complete-poi48l-kp" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_plan_id        = "eedd3585-90c6-4c8f-be3d-062069e99fc3" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_status         = "active" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m service                 = "kms" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m service_endpoints       = "public-and-private" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m state                   = "active" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m status                  = "active" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m sub_type                = "kms" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m tags                    = [] [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m target_crn              = "crn:v1:bluemix:public:globalcatalog::::deployment:eedd3585-90c6-4c8f-be3d-062069e99fc3%3Aeu-de" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m type                    = "service_instance" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m update_at               = "2023-11-29T09:21:01.024Z" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:     }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: [1m  # module.key_protect_all_inclusive.module.key_protect_key_rings["icd-etcd"].ibm_kms_key_rings.key_ring[0m will be [1m[31mdestroyed[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: [0m  [31m-[0m[0m resource "ibm_kms_key_rings" "key_ring" {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m endpoint_type = "public" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m force_delete  = true [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m id            = "icd-etcd:keyRing:crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8::" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m instance_id   = "bed19d91-dd72-4ee4-925b-148fb5c3e0d8" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m key_ring_id   = "icd-etcd" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:     }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: [1m  # module.key_protect_all_inclusive.module.key_protect_keys["icd-etcd.etcd-complete-poi48l-etcd"].ibm_kms_key.key[0m will be [1m[31mdestroyed[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: [0m  [31m-[0m[0m resource "ibm_kms_key" "key" {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m crn                     = "crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8:key:48fc2e76-8490-4d44-bd6c-317b57653e72" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m endpoint_type           = "public" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m force_delete            = true [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m id                      = "crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8:key:48fc2e76-8490-4d44-bd6c-317b57653e72" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m instance_crn            = "crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8::" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m instance_id             = "bed19d91-dd72-4ee4-925b-148fb5c3e0d8" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m key_id                  = "48fc2e76-8490-4d44-bd6c-317b57653e72" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m key_name                = "etcd-complete-poi48l-etcd" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m key_ring_id             = "icd-etcd" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_controller_url = "https://cloud.ibm.com/services/kms/crn%3Av1%3Abluemix%3Apublic%3Akms%3Aeu-de%3Aa%2Fabac0df06b644a9cabc6e44f55b3880e%3Abed19d91-dd72-4ee4-925b-148fb5c3e0d8%3A%3A" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_crn            = "crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8:key:48fc2e76-8490-4d44-bd6c-317b57653e72" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_name           = "etcd-complete-poi48l-etcd" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_status         = "1" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m standard_key            = false [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m type                    = "kms" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:     }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: [1m  # module.key_protect_all_inclusive.module.key_protect_keys["icd-etcd.etcd-complete-poi48l-etcd"].ibm_kms_key_policies.root_key_policy[0][0m will be [1m[31mdestroyed[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: [0m  [31m-[0m[0m resource "ibm_kms_key_policies" "root_key_policy" {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m endpoint_type           = "public" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m id                      = "crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8:key:48fc2e76-8490-4d44-bd6c-317b57653e72" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m instance_id             = "bed19d91-dd72-4ee4-925b-148fb5c3e0d8" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m key_id                  = "48fc2e76-8490-4d44-bd6c-317b57653e72" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_controller_url = "https://cloud.ibm.com/services/kms/crn%3Av1%3Abluemix%3Apublic%3Akms%3Aeu-de%3Aa%2Fabac0df06b644a9cabc6e44f55b3880e%3Abed19d91-dd72-4ee4-925b-148fb5c3e0d8%3A%3A" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_crn            = "crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8:key:48fc2e76-8490-4d44-bd6c-317b57653e72" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_name           = "etcd-complete-poi48l-etcd" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m resource_status         = "1" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m dual_auth_delete {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m created_by       = "IBMid-664003Y3Z3" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m creation_date    = "2023-11-29 09:21:45 +0000 UTC" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m crn              = "crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8:policy:c6e6f2a3-01fd-4eef-a8df-1825b6ec6a6f" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m enabled          = false [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m id               = "c6e6f2a3-01fd-4eef-a8df-1825b6ec6a6f" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m last_update_date = "2023-11-29 09:21:45 +0000 UTC" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m updated_by       = "IBMid-664003Y3Z3" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:         }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:       [31m-[0m[0m rotation {
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m created_by       = "IBMid-664003Y3Z3" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m creation_date    = "2023-11-29 09:21:34 +0000 UTC" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m crn              = "crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8:policy:56a32d31-ac49-4784-a120-aa682e247c95" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m enabled          = true [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m id               = "56a32d31-ac49-4784-a120-aa682e247c95" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m interval_month   = 1 [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m last_update_date = "2023-11-29 09:21:45 +0000 UTC" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:           [31m-[0m[0m updated_by       = "IBMid-664003Y3Z3" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:         }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:     }
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: 
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: [1mPlan:[0m 0 to add, 0 to change, 10 to destroy.
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: [0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185: Changes to Outputs:
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:   [31m-[0m[0m hostname = "4017c7a0-a874-4715-bb56-48b6d70e2630.c13p25pf03djhc8of4jg.private.databases.appdomain.cloud" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:   [31m-[0m[0m id       = "crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630::" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:   [31m-[0m[0m port     = "30754" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:28Z command.go:185:   [31m-[0m[0m version  = "3.4" [90m-> null[0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:35Z command.go:185: [0m[1mmodule.etcd_db.ibm_resource_key.service_credentials["etcd_admin"]: Destroying... [id=crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630:resource-key:8c483d62-8847-42ba-9a9a-89ae5d41b1f1][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:35Z command.go:185: [0m[1mmodule.key_protect_all_inclusive.module.key_protect[0].ibm_kms_instance_policies.key_protect_instance_policies: Destroying... [id=crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8::][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:35Z command.go:185: [0m[1mmodule.etcd_db.ibm_resource_key.service_credentials["etcd_viewer"]: Destroying... [id=crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630:resource-key:435f932d-0449-4e9b-a560-3a42f3332360][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:35Z command.go:185: [0m[1mmodule.key_protect_all_inclusive.module.key_protect[0].ibm_kms_instance_policies.key_protect_instance_policies: Destruction complete after 0s[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:35Z command.go:185: [0m[1mmodule.etcd_db.ibm_resource_key.service_credentials["etcd_operator"]: Destroying... [id=crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630:resource-key:32414200-5631-45e7-b0c0-e0f6ba4ee844][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:42Z command.go:185: [0m[1mmodule.etcd_db.ibm_resource_key.service_credentials["etcd_viewer"]: Destruction complete after 8s[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:42Z command.go:185: [0m[1mmodule.etcd_db.ibm_resource_key.service_credentials["etcd_operator"]: Destruction complete after 8s[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:43Z command.go:185: [0m[1mmodule.etcd_db.ibm_resource_key.service_credentials["etcd_admin"]: Destruction complete after 8s[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:43Z command.go:185: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Destroying... [id=crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:4017c7a0-a874-4715-bb56-48b6d70e2630::][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:53Z command.go:185: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Still destroying... [id=crn:v1:bluemix:public:databases-for-etc...4017c7a0-a874-4715-bb56-48b6d70e2630::, 10s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:56Z command.go:185: [0m[1mmodule.etcd_db.ibm_database.etcd_db: Destruction complete after 12s[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:56Z command.go:185: [0m[1mmodule.etcd_db.ibm_iam_authorization_policy.policy[0]: Destroying... [id=c046a955-e35b-4520-9d11-11e77700e492][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:34:59Z command.go:185: [0m[1mmodule.etcd_db.ibm_iam_authorization_policy.policy[0]: Destruction complete after 4s[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:35:00Z command.go:185: [0m[1mmodule.key_protect_all_inclusive.module.key_protect_keys["icd-etcd.etcd-complete-poi48l-etcd"].ibm_kms_key_policies.root_key_policy[0]: Destroying... [id=crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8:key:48fc2e76-8490-4d44-bd6c-317b57653e72][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:35:00Z command.go:185: [0m[1mmodule.key_protect_all_inclusive.module.key_protect_keys["icd-etcd.etcd-complete-poi48l-etcd"].ibm_kms_key_policies.root_key_policy[0]: Destruction complete after 0s[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:35:00Z command.go:185: [0m[1mmodule.key_protect_all_inclusive.module.key_protect_keys["icd-etcd.etcd-complete-poi48l-etcd"].ibm_kms_key.key: Destroying... [id=crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8:key:48fc2e76-8490-4d44-bd6c-317b57653e72][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:35:04Z command.go:185: [0m[1mmodule.key_protect_all_inclusive.module.key_protect_keys["icd-etcd.etcd-complete-poi48l-etcd"].ibm_kms_key.key: Destruction complete after 4s[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:35:04Z command.go:185: [0m[1mmodule.key_protect_all_inclusive.module.key_protect_key_rings["icd-etcd"].ibm_kms_key_rings.key_ring: Destroying... [id=icd-etcd:keyRing:crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8::][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:35:08Z command.go:185: [0m[1mmodule.key_protect_all_inclusive.module.key_protect_key_rings["icd-etcd"].ibm_kms_key_rings.key_ring: Destruction complete after 4s[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:35:08Z command.go:185: [0m[1mmodule.key_protect_all_inclusive.module.key_protect[0].ibm_resource_instance.key_protect_instance: Destroying... [id=crn:v1:bluemix:public:kms:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:bed19d91-dd72-4ee4-925b-148fb5c3e0d8::][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:35:18Z command.go:185: [0m[1mmodule.key_protect_all_inclusive.module.key_protect[0].ibm_resource_instance.key_protect_instance: Still destroying... [id=crn:v1:bluemix:public:kms:eu-de:a/abac0...bed19d91-dd72-4ee4-925b-148fb5c3e0d8::, 10s elapsed][0m[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:35:20Z command.go:185: [0m[1mmodule.key_protect_all_inclusive.module.key_protect[0].ibm_resource_instance.key_protect_instance: Destruction complete after 13s[0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:35:21Z command.go:185: [0m[1m[32m
TestRunCompleteExampleOtherVersion 2023-11-29T09:35:21Z command.go:185: Destroy complete! Resources: 10 destroyed.
TestRunCompleteExampleOtherVersion 2023-11-29T09:35:21Z command.go:185: [0m
TestRunCompleteExampleOtherVersion 2023-11-29T09:35:21Z tests.go:349: END: Destroy
--- PASS: TestRunCompleteExampleOtherVersion (1025.81s)
PASS
ok  	github.com/terraform-ibm-modules/terraform-ibm-icd-etcd	1029.638s

</details>